# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 2  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]

  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, conv_bn_hswish, [16, 2]]  # 0-P1/2

  - [-1, 1, MobileNetV3_InvertedResidual, [16, 16, 3, 2, 1, 0]]  # 1-p2/4

  - [-1, 1, MobileNetV3_InvertedResidual, [24, 72, 3, 2, 0, 0]]  # 2-p3/8
  - [-1, 1, MobileNetV3_InvertedResidual, [24, 88, 3, 1, 0, 0]]

  - [-1, 1, MobileNetV3_InvertedResidual, [40, 96, 5, 2, 1, 1]]  # 4-p4/16
  - [-1, 1, MobileNetV3_InvertedResidual, [40, 240, 5, 1, 1, 1]]
  - [-1, 1, MobileNetV3_InvertedResidual, [40, 240, 5, 1, 1, 1]]
  - [-1, 1, MobileNetV3_InvertedResidual, [48, 120, 5, 1, 1, 1]]
  - [-1, 1, MobileNetV3_InvertedResidual, [48, 144, 5, 1, 1, 1]]

  - [-1, 1, MobileNetV3_InvertedResidual, [96, 288, 5, 2, 1, 1]]  # 9-p5/32
  - [-1, 1, MobileNetV3_InvertedResidual, [96, 576, 5, 1, 1, 1]]
  - [-1, 1, MobileNetV3_InvertedResidual, [96, 576, 5, 1, 1, 1]]


# YOLOv8.0n head
head:
  - [-1, 1, DySample, []]
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 14

  - [-1, 1, DySample, []]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f_DWR_DRB, [512]]  # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f_DWR_DRB, [1024]]  # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]  # Detect(P3, P4, P5)